Autodesk.Revit.DB.Analysis.ZoneGeometricDefinition
An enumerated type listing possible geometric definition types for generic zones.
Since:
2026
Since:
2026

Autodesk.Revit.DB.Analysis.ZoneGeometricDefinition.Spaces
The zone geometry is defined by a selection of MEP spaces.

Autodesk.Revit.DB.Analysis.ZoneGeometricDefinition.Sketch
The zone geometry is defined by a sketch linework.